Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་བཅུ་པོ་འདི་དག་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོའི་སྔ་ལྟས་ཡིན་ནོ། །
en: “Noble one, those ten are the omens of the ten bodhisattva bhūmis of the bodhisattva mahāsattvas.

source: དེ་ལ་རིགས་ཀྱི་བུ་དེ་ཅིའི་ཕྱིར་ས་དང་པོ་ལ་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་ཞེ་ན།
en: “Noble one, why is the first bhūmi called Perfect Joy?

source: དེ་ནི་ཐོག་མར་འཇིག་རྟེན་ལས་འདས་པའི་སེམས་སྔོན་མ་ཐོབ་པ་དེ་མངོན་དུ་གྱུར་ཏེ། དོན་ཆེན་པོའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་ཕྱིར། རབ་ཏུ་དགའ་བ་ཆེན་པོ་སྐྱེ་བས་ས་དང་པོ་ལ་རབ་ཏུ་དགའ་བ་ཞེས་བྱའོ། །
en: The first bhūmi is called Perfect Joy because at the beginning, a mind that transcends the world, which had not previously been attained, is made manifest, and as the aspiration to a great goal has been fulfilled, there is a great joy that arises.

source: ལྟུང་བ་ཕྲ་མོའི་དྲི་མ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཉེས་པ་ཐམས་ཅད་རྣམ་པར་དག་པའི་ཕྱིར། ས་གཉིས་པ་ནི་དྲི་མ་མེད་པ་ཞེས་བྱའོ། །
en: “The second bhūmi is called Stainless because it is purified of even the slightest stains of downfalls and of all faults in conduct.

source: ཚད་མེད་པའི་ཡེ་ཤེས་དང་། ཏིང་ངེ་འཛིན་གྱི་ཡེ་ཤེས་འོད་སྣང་བ་དེ་བསྐྱོད་པར་མི་ནུས་ཤིང་གང་གིས་ཀྱང་ཟིལ་གྱིས་མི་ནོན་པ་དང་། ཐོས་པ་འཛིན་པའི་གཟུངས་ལ་གནས་པའི་ཕྱིར་ས་གསུམ་པ་ནི་འོད་བྱེད་པ་ཞེས་བྱའོ། །
en: “The third bhūmi is called Shining because there is the shining light of measureless wisdom and the wisdom of samādhi, which cannot be undermined, cannot be outshone by anything, and remains in the power of retention that holds what has been heard.

source: ཤེས་རབ་ཀྱི་མེས་ཉོན་མོངས་པ་ཐམས་ཅད་སྲེག་ཅིང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་བསྒོམས་པའི་མེའི་འོད་འཕྲོ་བ་ཆེར་གྱུར་པས་ས་བཞི་པ་ལ་ནི་འོད་འཕྲོ་བ་ཞེས་བྱའོ། །
en: “The fourth bhūmi is called Blazing because the fire of wisdom incinerates all kleśas, and the blazing light of meditation on the qualities of the aspects of enlightenment increases.

source: དེ་བསྒོམ་པའི་ཐབས་དང་། མཆོག་གི་ཡེ་ཤེས་ལ་དབང་སྒྱུར་བར་དཀའ་བ་དང་། མཐོང་བ་དང་། བསྒོམས་པས་སྤངས་པའི་ཉོན་མོངས་པ་ཐུལ་བར་དཀའ་བ་ཐུལ་བའི་ཕྱིར་ས་ལྔ་པ་ལ་ཤིན་ཏུ་སྦྱང་དཀའ་བ་ཞེས་བྱའོ། །
en: “The fifth bhūmi is called Difficult Training because the method of meditation and the supreme wisdom are difficult to master, and the kleśas that are difficult to subjugate through the paths of seeing and meditation have been subjugated.

source: འདུ་བྱེད་ཀྱི་ཆོས་བར་ཆད་མེད་པར་མངོན་དུ་གྱུར་ཏེ། མཚན་མ་མེད་པ་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་མངོན་དུ་བྱེད་པས། ས་དྲུག་པ་ལ་མངོན་སུམ་པ་ཞེས་བྱའོ། །
en: “The sixth bhūmi is called Manifested because there is the manifestation of the absence of obstruction from composite phenomena, and the manifestation of all featureless mentation.

source: ཟག་པ་མེད་པའི་ཆོས་རྣམས་ལ་བར་ཆད་མེད་ཅིང་མཚན་མ་མེད་པ་ཡིད་ལ་བྱེད་པས། རྣམ་པར་གྲོལ་བའི་ཏིང་ངེ་འཛིན་ལ་རྒྱུན་རིང་དུ་བསྒོམས་པས། ས་དེ་རྣམ་པར་དག་ཅིང་ཐོགས་པ་མེད་པའི་ཕྱིར། ས་བདུན་པ་ནི་རིང་དུ་སོང་བ་ཞེས་བྱའོ། །
en: “The seventh bhūmi is called Gone Far because there is a long, continuous meditation in liberated samādhi, because of there being no obstacles to stainless qualities and because of featureless mentation.

source: མཚན་མ་མེད་པ་ཡིད་ལ་བྱེད་པ་བསྒོམ་པ་ལ་དབང་ཐོབ་སྟེ། ཉོན་མོངས་པ་རྣམས་ཀྱིས་གཡོ་བར་མི་ནུས་པས་ན། ས་བརྒྱད་པ་ནི་མི་གཡོ་བ་ཞེས་བྱའོ། །
en: “The eighth bhūmi is called Unwavering because, through attainment of the mastery of featureless mentation, the kleśas are unable to cause instability.

source: རྣམ་པ་ཐམས་ཅད་དུ་ཆོས་སྟོན་པ་ལ་དབང་དུ་གྱུར་པས། ཁ་ན་མ་ཐོ་བ་མེད་ཅིང་། བློ་གྲོས་ཤིན་ཏུ་ཡངས་པ་ཐོགས་པ་མེད་པ་ཐོབ་པའི་ཕྱིར། ས་དགུ་པ་ནི་ལེགས་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: “The ninth bhūmi is called Perfect Understanding because, through the mastery of teaching the Dharma in all its aspects, there are no transgressions and there is the attainment of unimpeded, vast understanding.

source: ཆོས་ཀྱི་སྐུ་ནམ་མཁའ་ལྟ་བུ་ལ། ཡེ་ཤེས་ཆེན་པོའི་སྤྲིན་ལྟ་བུས་ཁྱབ་པར་འགེབས་པའི་ཕྱིར། ས་བཅུ་པ་ནི་ཆོས་ཀྱི་སྤྲིན་ཅེས་བྱའོ། །
en: “The tenth bhūmi is called Cloud of Dharma because the Dharma body is like the sky covered by the clouds of great wisdom.

source: དེ་ལ་རིགས་ཀྱི་བུ་ཆོས་དང་གང་ཟག་ལ། མཚན་མ་ཅན་དུ་མངོན་པར་ཞེན་པའི་རྨོངས་པ་དང་། འཁོར་བ་དང་ངན་སོང་གི་ཉོན་མོངས་པས་འཇིགས་པའི་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་དང་པོ་ལ་སྒྲིབ་བོ། །
en: “Noble one, the first bhūmi is obscured by these two kinds of ignorance: the ignorance of attachment to the features of phenomena and individuals, and the ignorance of being terrified by the torments of saṃsāra and the lower realms.

source: ལྟུང་བ་ཕྲ་མོའི་འཁྲུལ་པ་ལ་རྨོངས་པ་དང་། ལས་དང་སྤྱོད་པ་རྣམ་པ་སྣ་ཚོགས་མངོན་པར་སྐྱེད་པའི་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་གཉིས་པ་ལ་སྒྲིབ་པོ། །
en: “The second bhūmi is obscured by these two kinds of ignorance: the ignorance of the delusion of subtle downfalls, and the ignorance that gives rise to various kinds of actions and conduct.

source: མ་ཐོབ་པ་ཐོབ་པར་འདོད་པའི་རྨོངས་པ་དང་། གཟུངས་དམ་པའི་མཆོག་ཐོབ་པ་ལ་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་གསུམ་པ་ལ་སྒྲིབ་བོ། །
en: “The third bhūmi is obscured by these two kinds of ignorance: the ignorance of wishing to attain what has not been attained, and ignorance concerning attaining the supreme, sublime power of retention.

source: མཉམ་པར་གཞག་པའི་རོའི་དགའ་བ་ལ་སྲེད་པའི་རྨོངས་པ་དང་། ཆོས་རྣམ་པར་དག་པ་ལ་སྲེད་པའི་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་བཞི་པ་ལ་སྒྲིབ་པོ། །
en: “The fourth bhūmi is obscured by these two kinds of ignorance: the ignorance of craving for the delight of resting in meditation, and the ignorance of craving for pure Dharma.

source: འཁོར་བ་ལ་ཤིན་ཏུ་སྐྱོ་བའི་རྨོངས་པ་དང་། མྱ་ངན་ལས་འདས་པ་ལ་མངོན་པར་གཞོལ་བའི་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་ལྔ་པ་ལ་སྒྲིབ་པོ། །
en: “The fifth bhūmi is obscured by these two kinds of ignorance: the ignorance of being saddened by saṃsāra, and the ignorance of exerting oneself for nirvāṇa.

source: འདུ་བྱེད་ཀྱི་རྒྱུ་བ་མངོན་དུ་གྱུར་པའི་རྨོངས་པ་དང་། མཚན་མ་སྦོམ་པོ་མངོན་དུ་གྱུར་པའི་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་དྲུག་པ་ལ་སྒྲིབ་པོ། །
en: “The sixth bhūmi is obscured by these two kinds of ignorance: the ignorance of perceiving the movement of the composite, and the ignorance of perceiving evident features.

source: མཚན་མ་ཕྲ་མོ་མངོན་དུ་གྱུར་པའི་རྨོངས་པ་དང་། མཚན་མ་མེད་པ་ཡིད་ལ་བྱེད་པའི་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་བདུན་པ་ལ་སྒྲིབ་པོ། །
en: “The seventh bhūmi is obscured by these two kinds of ignorance: the ignorance of manifest subtle features, and the ignorance of featureless mentation.

source: མཚན་མ་མེད་པ་ལ་ཆེད་དུ་རྩོལ་བའི་རྨོངས་པ་དང་། མཚན་མར་འཛིན་པ་ལ་དབང་ཐོབ་པའི་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་བརྒྱད་པ་ལ་སྒྲིབ་པོ། །
en: “The eighth bhūmi is obscured by these two kinds of ignorance: the ignorance of exertion toward featurelessness, and the ignorance of attaining power over the grasping of features.

source: གང་ཆོས་སྟོན་པ་ཚད་མེད་པ་དང་། ཚིག་དང་ཡི་གེ་ཚད་མེད་པ་ལ་མཁས་པར་མ་གྱུར་པའི་རྨོངས་པ་དང་། སྤོབས་པ་ལ་དབང་མ་ཐོབ་པའི་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་དགུ་པ་ལ་སྒྲིབ་པོ། །
en: “The ninth bhūmi is obscured by these two kinds of ignorance: the ignorance of not being skilled in whatever Dharma is taught as being limitless, with limitless words and letters, and the ignorance of not having attained the power of eloquence.

source: མངོན་པར་ཤེས་པ་ཆེན་པོ་ལ་དབང་སྒྱུར་བ་མ་ཐོབ་པའི་རྨོངས་པ་དང་། དོན་དང་། ལས་གསང་བ་ཕྲ་མོ་ལ་མཁས་པར་མ་གྱུར་པའི་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་ས་བཅུ་པ་ལ་སྒྲིབ་བོ། །སྤྱོད་ཡུལ་ཤིན་ཏུ་ཕྲ་བ་ཐམས་ཅད་ལ།
en: “The tenth bhūmi is obscured by these two kinds of ignorance: the ignorance of not having attained the power of great higher cognitions, and the ignorance of not being skilled in subtle, secret meanings and actions.

source: ཤེས་བྱའི་སྒྲིབ་པའི་རྨོངས་པ་དང་། ཉོན་མོངས་པ་ཤིན་ཏུ་ཕྲ་བའི་གནས་ངན་ལེན་ལ་རྨོངས་པ་དང་། རྨོངས་པ་འདི་གཉིས་ཀྱིས་སངས་རྒྱས་ཀྱི་ས་ལ་སྒྲིབ་པའོ། །
en: “The bhūmi of buddhahood is obscured by these two kinds of ignorance: the ignorance of the obscuration of knowledge and the ignorance of the negative propensities of extremely subtle kleśas.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “Noble one, the bodhisattva who is on the first bodhisattva bhūmi has ascended to the perfection of generosity.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་གཉིས་པ་ལ་ནི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “The bodhisattva who is on the second bodhisattva bhūmi has ascended to the perfection of correct conduct.

source: ས་གསུམ་པ་ལ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “The bodhisattva who is on the third bodhisattva bhūmi has ascended to the perfection of patience.

source: ས་བཞི་པ་ལ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “The bodhisattva who is on the fourth bodhisattva bhūmi has ascended to the perfection of diligence.

source: ས་ལྔ་པ་ལ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “The bodhisattva who is on the fifth bodhisattva bhūmi has ascended to the perfection of meditation.

source: ས་དྲུག་པ་ལ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “The bodhisattva who is on the sixth bodhisattva bhūmi has ascended to the perfection of wisdom.

source: ས་བདུན་པ་ལ་ནི་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “The bodhisattva who is on the seventh bodhisattva bhūmi has ascended to the perfection of skill in methods.

source: ས་བརྒྱད་པ་ལ་ནི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “The bodhisattva who is on the eighth bodhisattva bhūmi has ascended to the perfection of prayer.

source: ས་དགུ་པ་ལ་ནི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “The bodhisattva who is on the ninth bodhisattva bhūmi has ascended to the perfection of strength.

source: ས་བཅུ་པ་ལ་ནི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གནོན་ཏོ། །
en: “The bodhisattva who is on the tenth bodhisattva bhūmi has ascended to the perfection of knowledge.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་བསྐྱེད་པ་དང་པོ་ནི། རིན་པོ་ཆེ་ཡང་དག་པར་འཕགས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་སྟེ་སྐྱེའོ། །
en: “Noble one, the first development of aspiration of a bodhisattva mahāsattva is obtained and arises through the samādhi that is a superior jewel.

source: སེམས་བསྐྱེད་པ་གཉིས་པ་ནི་གནས་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་སྟེ་སྐྱེའོ། །
en: “The second development of aspiration is obtained and arises through the samādhi that has no location.

source: སེམས་བསྐྱེད་པ་གསུམ་པ་ནི་རབ་ཏུ་མི་གཡོ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་སྟེ་སྐྱེའོ། །
en: “The third development of aspiration is obtained and arises through samādhi that is unwavering.

source: སེམས་བསྐྱེད་པ་བཞི་པ་ནི་ཕྱིར་མི་ལྡོག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་སྟེ་སྐྱེའོ། །
en: “The fourth development of aspiration is obtained and arises through samādhi that is irreversible.

source: སེམས་བསྐྱེད་པ་ལྔ་པ་ནི་རིན་པོ་ཆེའི་མེ་ཏོག་གི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་སྟེ་སྐྱེའོ། །
en: “The fifth development of aspiration is obtained and arises through the samādhi of precious flowers.

source: སེམས་བསྐྱེད་པ་དྲུག་པ་ནི་ཉི་མའི་འོད་ཀྱི་གཟི་བརྗིད་ཀྱི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་སྟེ་སྐྱེའོ། །
en: “The sixth development of aspiration is obtained and arises through the samādhi of the brilliance of sunlight.

source: སེམས་བསྐྱེད་པ་བདུན་པ་ནི་དོན་ཐམས་ཅད་གྲུབ་པའི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་སྟེ་སྐྱེའོ། །
en: “The seventh development of aspiration is obtained and arises through the samādhi that accomplishes all goals.

source: སེམས་བསྐྱེད་པ་བརྒྱད་པ་ནི་ད་ལྟར་གྱི་སངས་རྒྱས་མངོན་སུམ་དུ་བཞུགས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་སྟེ་སྐྱེའོ། །
en: “The eighth development of aspiration is obtained and arises through the samādhi of the directly perceived presence of the present buddhas.

source: སེམས་བསྐྱེད་པ་དགུ་པ་ནི་ཡེ་ཤེས་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་སྟེ་སྐྱེའོ། །
en: “The ninth development of aspiration is obtained and developed through the samādhi of the lamp of wisdom.

source: སེམས་བསྐྱེད་པ་བཅུ་པ་ནི་དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ཡོངས་སུ་བཟུང་ནས་སྐྱེ་སྟེ། རིགས་ཀྱི་བུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་བཅུའོ། །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་ཁྱད་པར་གྱིས་བྱིན་གྱིས་བརླབས་པ་ཞེས་བྱ་བའི་གཟུངས་འདི་སྐྱེ་སྟེ་གཟུངས་ལ། ཏདྱ་ཐཱ། པཱུརྞ་མ་ནོ་ར་ཐེ། དུ་ཧུ་དུ་ཧུ་དུ་ཧུ།
en: “The tenth development of aspiration is obtained and arises through the samādhi that is heroic.

source: ཡཱ་བཏ་སཱུརྱ་ཨ་བ་བྷཱ་ས་ཏཱ། ཡཱ་བཏ་ཙནྡྲ་དཽ་དཏྟེ། དཱ་བཱ་ད་རཀྵ་མཱན། དཎྜ་པ་རི་ཧཱ་རམ་ཀུ་རུ་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ས་དང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་ཏེ། སུ་ཞིག་གཟུངས་སྔགས་འདི་འདོན་ཅིང་འཛིན་ན། འཇིགས་པ་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་བ་ནི། འདི་ལྟ་སྟེ། སྟག་དང་སེང་གེ་ལ་སོགས་པ་གཅན་གཟན་མ་རུངས་པའི་རིགས་དང་། ཡི་དགས་ཐམས་ཅད་དང་། མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་ཏེ། དགྲ་དང་།
en: “Noble one, on the first bodhisattva bhūmi of the bodhisattva mahāsattvas there arises and is obtained the dhāraṇī called consecration: tadyathā | pūrṇamno rathe duhu duhu duhu yāvat sūryāvabhāsatā yāvat candra daudatte dāvād arakṣamān daṇạparihāram kuru svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in a Ganges River will protect the bodhisattvas on the first bhūmi.

source: རྐུན་པོ་དང་། གཟའ་དང་། ཉོན་མོངས་པ་རྣམས་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལས་རྣམ་པར་གྲོལ་ཏེ། ས་དང་པོ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་གཉིས་པ་ལ་གཞན་གྱིས་མི་ཐུབ་པ་ཞེས་བྱ་བའི་གཟུངས་འདི་སྐྱེའོ། །གཟུངས་ལ། ཏདྱ་ཐཱ། ཨུཏྟོ་ལི། ཙི་རི་ཙི་རི། ཨུཏྟོ་རཱ།
en: “Those who recite and possess this dhāraṇī mantra will be freed from all fears, which means freed from vicious beasts such as tigers and lions; freed from all pretas, humans, nonhumans, and so on; and freed from enemies, robbers, the planets, the kleśas, and the five kinds of obscurations, and they will remember the first bhūmi.

source: ཏོ་ར་ཎཾ། ཤཱནྟོ་ཤཱནྟོ། ཨཏྟོ་ལི། ཧུ་ལུ་ཧུ་ལུ་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་གང་གཱའི་ཀླུང་གཉིས་ཀྱི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ས་གཉིས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་སོ། །གང་ལ་ལ་ཞིག་གཟུངས་སྔགས་འདི་ཀློག་ཅིང་འཛིན་ན། འཇིགས་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་ཏེ། དེ་གཅན་གཟན་མ་རུངས་པ་དང་། ཡི་དགས་མ་རུངས་པ་དང་། མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་པས་གཙེ་བ་དང་། ཕ་རོལ་གྱི་དགྲ་དང་།
en: “Noble one, on the second bodhisattva mahāsattva bhūmi, the dhāraṇī called invincibility arises and is obtained: tadyathā | uttoli ciriciri uttorā toranaṃ śānto śānto attoli hulu hulu svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in two Ganges Rivers will protect the bodhisattvas on the second bhūmi.

source: གཟའ་དང་། ཉོན་མོངས་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལས་རྣམ་པར་གྲོལ་ཏེ། ས་གཉིས་པ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ས་གསུམ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་གཟུངས་འདི་སྐྱེའོ། །གཟུངས་ལ། ཏདྱ་ཐཱ། དཎྛི་ཀེ། བཎྛི་ཀེ།
en: “Those who recite and possess this dhāraṇī mantra will be freed from all terrors, which means freed from vicious beasts, vicious pretas, human and nonhuman attacks, opposing enemies, the planets, the kleśas, suffering, and the five kinds of obscurations, and they will remember the second bhūmi.

source: ཀ་ར་ཋཱི། ཀཽ་ར་ཋི། ཀཻ་ཡཱུ་རེ་དནྟི་ལི་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་གང་གཱའི་ཀླུང་གསུམ་གྱི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས། ས་གསུམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་ཏེ། སུ་གཟུངས་སྔགས་འདི་འཆང་བ་དང་། འདོན་པ་དེ་འཇིགས་པ་ཐམས་ཅད་དང་། གཅན་གཟན་མ་རུངས་པ་དང་། གདོན་མ་རུངས་པ་དང་། མི་དང་མི་མ་ཡིན་པ་ཐམས་ཅད་ལ་སོགས་པས་གཙེ་བ་དང་།
en: “Noble one, for the bodhisattva mahāsattva who is on the third bodhisattva bhūmi, the dhāraṇī called firm presence will arise and be obtained: tadyathā | daṇṭhike vaṇṭhike karaṭhī kauraṭhi kaiyūre tantili svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in three Ganges Rivers will protect the bodhisattvas on the third bhūmi.

source: གཟའ་དང་། ཕ་རོལ་གྱི་དགྲ་དང་། སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལས་རྣམ་པར་གྲོལ་ཏེ། ས་གསུམ་པ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ས་བཞི་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་གདུལ་དཀའ་བ་ཞེས་བྱ་བའི་གཟུངས་འདི་སྐྱེའོ། །གཟུངས་ལ། ཏདྱ་ཐཱ། ཤི་རི་ཤི་རི། དི་མི་དི་མི་ནི། ད་རི་ད་རི་ཎི། ཤི་རི་ཤི་རི་ཎི།
en: “Those who recite and possess this dhāraṇī mantra will be freed from all terrors—vicious beasts, vicious demons, attacks from humans and nonhumans and so on, the planets, opposing enemies, various kinds of suffering, and the five kinds of obscurations—and they will remember the third bhūmi.

source: བི་ཤཱ་ལཱ། བི་ཤཱི་ལཱ། པ་ཤ་པ་ཤ་ནི། བནྡྷ་ནི་ཡེ་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་གང་གཱའི་ཀླུང་བཞིའི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ས་བཞི་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་ཏེ། སུས་གཟུངས་སྔགས་འདི་འདོན་པ་དང་། འཆང་བ་དེ་འཇིགས་པ་ཐམས་ཅད་དང་། གཅན་གཟན་ཁྲོ་བོ་དང་། ཡི་དགས་མ་རུངས་པ་དང་། མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་ཏེ།
en: “Noble one, for the bodhisattva mahāsattva who is on the fourth bodhisattva bhūmi, the dhāraṇī called unsubjugated will arise and be obtained: tadyathā | śiriśiri dimi dimini dari darini śiri śiriṇi viśalā viśālā paśa paśani bandhniye svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in four Ganges Rivers will protect the bodhisattvas on the fourth bhūmi.

source: ཕ་རོལ་གྱི་དགྲ་དང་། སྡུག་བསྔལ་མང་པོས་གཙེ་བ་དང་། གཟའ་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལས་ཀྱང་རྣམ་པར་གྲོལ་ཏེ། ས་བཞི་པ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ས་ལྔ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཡོན་ཏན་སྣ་ཚོགས་ཀྱིས་བཀོད་པ་ཅེས་བྱ་བའི་གཟུངས་འདི་སྐྱེའོ། །གཟུངས་ལ། ཏདྱ་ཐཱ། ཧ་རི་ཧ་རི་ཎི། ཙི་རི་ཙི་རི་ཎི། ཀ་རི་མཱ་ཎི། སང་ཀ་རི་མཱ་ཎི། སམྦཱ་ས་ནི།
en: “Whoever possesses and recites this dhāraṇī mantra will be freed from all terrors—fierce beasts, malevolent pretas, humans and nonhumans and so on, opposing enemies, the torments of various kinds of suffering, the planets, and the five kinds of obscurations—and they will remember the fourth bhūmi.

source: ཛམྦྷ་ནི། སྟམྦྷ་ནི། མོ་ཧ་ནི། སྭ་ཡ་མཱུཀྐེ་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་གང་གཱའི་ཀླུང་ལྔའི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ས་ལྔ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་ཏེ། སུས་གཟུངས་སྔགས་འདི་འདོན་ཅིང་འཆང་ན། འཇིགས་པ་ཐམས་ཅད་དང་། གཅན་གཟན་ཁྲོ་བོ་དང་། ཡི་དགས་མ་རུངས་པ་དང་། མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་ཏེ།
en: “Noble one, for the bodhisattva mahāsattva who is on the fifth bodhisattva bhūmi, the dhāraṇī called the array of various qualities will arise and be obtained: tadyathā | hari hariṇi ciri ciriṇi karimāṇi saṅkarimāṇi sambāsani jambhani stambhani mohani svamūkke svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in five Ganges Rivers will protect the bodhisattvas on the fifth bhūmi.

source: ཕ་རོལ་གྱི་དགྲ་དང་། སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གཙེ་བ་དང་། གཟའ་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལས་རྣམ་པར་གྲོལ་ཏེ། ས་ལྔ་པ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ས་དྲུག་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་སྒྲོན་མ་ཞེས་བྱ་བའི་གཟུངས་འདི་སྐྱེའོ། །གཟུངས་ལ། ཏདྱ་ཐཱ། བི་ཏོ་རི། བི་ཏོ་རི། མ་རི་ཎི། ཀ་ལི་ཀ་ལི། བི་དྷོ་ཧན་ཏི། ལུ་ལུ་ལུ་ལུ། ཙུ་ལུ་ཙུ་ལུ། ཏོ་ལུ་བ་ཏོ་ལུ་བ། ཤ་ཤ། ཤཙྪ།
en: “Those who recite and possess this dhāraṇī mantra will be freed from all terrors—fierce beasts, malevolent pretas, humans and nonhumans and so on, opposing enemies, the torments of various kinds of suffering, the planets, and the five kinds of obscurations—and they will remember the fifth bhūmi.

source: བ་རི་ཤ་སྭ་སྟི། སརྦ་སཏྭ་ནཾ། སིད་དྷྱནྟུ་མཱ་མ། མནྟྲ་བཱ་དཱ་ནི་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་གང་གཱའི་ཀླུང་དྲུག་གི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ས་དྲུག་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་ཏེ། སུས་གཟུངས་སྔགས་འདི་འདོན་ཅིང་འཆང་ན། འཇིགས་པ་ཐམས་ཅད་དང་། གཅན་གཟན་ཁྲོ་བོ་དང་། ཡི་དགས་མ་རུངས་པ་དང་། མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་ཏེ།
en: “Noble one, for the bodhisattva mahāsattva who is on the sixth bodhisattva bhūmi, the dhāraṇī called the lamp of the field of wisdom will arise and be obtained: tadyathā | vitori vitori mariṇi kali kali vidho hanati lulu lulu culu culu toluva toluva śaśa śaccha variśa svasti sarva satvānāṃ siddhyantu mama mantravādāni svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in six Ganges Rivers will protect the bodhisattvas on the sixth bhūmi.

source: ཕ་རོལ་གྱི་དགྲ་དང་། སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གཙེ་བ་དང་། གཟའ་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལས་ཀྱང་རྣམ་པར་གྲོལ་ཏེ། ས་དྲུག་པ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ས་བདུན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཁྱད་པར་དུ་འཕགས་པ་ཞེས་བྱ་བའི་གཟུངས་འདི་སྐྱེའོ། །གཟུངས་ལ། ཏདྱ་ཐཱ། ཛ་ཧ་ཛ་ཧ་རུ། ཛ་ཧ་ཛ་ཧ་ཛ་ཧ་རུ། བཻ་ལུ་ཀེ། བཻ་ལུ་ཀེ། ཨ་མྲྀ་ཏགྷ་ཎེ། པ་རུ་ཤ་ཎེ། བཻ་རུ་ཏི་ཀེ། བ་རུ་བཏྟེ། བི་དྷི་ཧི་ཀེ།
en: “Those who recite and possess this dhāraṇī mantra will be freed from all terrors—fierce beasts, malevolent pretas, humans and nonhumans and so on, opposing enemies, the torments of various kinds of suffering, the planets, and the five kinds of obscurations—and they will remember the sixth bhūmi.

source: བིནྡ་བི་ལི་ནི། ཨ་མྲྀ་ལུ་ཏི་ཀེ། བྷཻ་ཛུ་ཡུ། བྷཻ་ཛུ་ཡུ་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་གང་གཱའི་ཀླུང་བདུན་གྱི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ས་བདུན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་ཏེ། སུས་གཟུངས་སྔགས་འདི་འདོན་ཅིང་འཆང་ན། འཇིགས་པ་ཐམས་ཅད་དང་། གཅན་གཟན་ཁྲོ་བོ་དང་། ཡི་དགས་མ་རུངས་པ་དང་། མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་ཏེ།
en: “Noble one, for the bodhisattva mahāsattva who is on the seventh bodhisattva bhūmi, the dhāraṇī called superiority will arise and be obtained: tadyathā | jaha jaharu jaha jaha jaharu vailuke amṛteghaṇe puruśaṇe vairutike varubatte vidhi hike vinda vilini amṛlutike bhaijuyu bhaijuyu svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in seven Ganges Rivers will protect the bodhisattvas on the seventh bhūmi.

source: ཕ་རོལ་གྱི་དགྲ་དང་། སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གཙེ་བ་དང་། གཟའ་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལས་ཀྱང་རྣམ་པར་གྲོལ་ཏེ། ས་བདུན་པ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ས་བརྒྱད་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་རྙོག་པ་མེད་པའི་རྟོག་པ་ཞེས་བྱ་བའི་གཟུངས་འདི་སྐྱེའོ། །གཟུངས་ལ། ཏདྱ་ཐཱ། ཤི་རི་ཤི་རི། ཤི་རི་ཎི། མི་ཏེ་མི་ཏེ།
en: “Those who recite and possess this dhāraṇī mantra will be freed from all terrors—fierce beasts, malevolent pretas, humans and nonhumans and so on, opposing enemies, the torments of various kinds of suffering, the planets, and the five kinds of obscurations—and they will remember the seventh bhūmi.

source: ཀ་རི་ཀ་རི། ཧེ་རུ་ཧེ་རུ། ཙུ་རུ་ཙུ་རུ། བནྡྷ་ནི་སྭཱ་ཧཱ། རིགས་ཀྱི་བུ་གཟུངས་འདི་ནི་གང་གཱའི་ཀླུང་བརྒྱད་ཀྱི་བྱེ་མ་སྙེད་ལས་འདས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ས་བརྒྱད་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བསྲུང་བའི་ཕྱིར་གསུངས་ཏེ། སུས་གཟུངས་སྔགས་འདི་འདོན་ཅིང་འཆང་ན། འཇིགས་པ་ཐམས་ཅད་དང་། གཅན་གཟན་ཁྲོ་བོ་དང་། ཡི་དགས་མ་རུངས་པ་དང་། མི་དང་མི་མ་ཡིན་པ་ལ་སོགས་ཏེ།
en: “Noble one, for the bodhisattva mahāsattva who is on the eighth bodhisattva bhūmi, the dhāraṇī called unpolluted thought will arise and be obtained: tadyathā | sari śari śiriṇi mitemite kari kari heru heru curu curu bandhani svāhā | “Noble one, this dhāraṇī is recited so that more buddha bhagavats than there are grains of sand in eight Ganges Rivers will protect the bodhisattvas on the eighth bhūmi.

source: ཕ་རོལ་གྱི་དགྲ་དང་། སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གཙེ་བ་དང་། གཟའ་དང་། སྒྲིབ་པ་རྣམ་པ་ལྔ་ལས་ཀྱང་རྣམ་པར་གྲོལ་ཏེ། ས་བརྒྱད་པ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ས་དགུ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་སྒོ་མཐའ་ཡས་པའི་རྒྱུན་ཅེས་བྱ་བའི་གཟུངས་འདི་སྐྱེའོ། །གཟུངས་ལ། ཏདྱ་ཐཱ། ཧ་རི་ཙཎྜ་ལི་ཀེ། ཀུ་ལ་མཱ་བྷ་ཏེ། ཏོ་ར་ཤི་པ་ཏ་པ་ཏ་སི།
en: “Those who recite and possess this dhāraṇī mantra will be freed from all terrors—fierce beasts, malevolent pretas, humans and nonhumans and so on, opposing enemies, the torments of various kinds of suffering, the planets, and the five kinds of obscurations—and they will remember the eighth bhūmi.
